i = 0
while i < 3:
    a = int(input())
    b = int(input())
    print(a+b)
    i += 1

print('Сколько бананов и ананасов для обезьян?')
a = int(input())
b = int(input())
print('Всего', a+b, 'шт.')
print('Сколько жуков и червей для ежей?')
a = int(input())
b = int(input())
print('Всего', a+b, 'шт.')
print('Сколько рыб и моллюсков для выдр?')
a = int(input())
b = int(input())
print('Всего', a+b, 'шт.')
"""
Сколько бананов и ананасов для обезьян?
15
5
Всего 20 шт.
Сколько жуков и червей для ежей?
50
12
Всего 62 шт.
Сколько рыб и моллюсков для выдр?
16
8
Всего 24 шт.
"""
